## Plan Result (pocket-event-bridge-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807048691)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 72 to add, 0 to change, 7 to destroy.</code></pre>

* Create
  * aws_cloudwatch_event_rule.collection-events-topic_PocketEventBridge-Prod-CollectionEvents-EventBridge-Rule_event-bridge-rule_83F8780B
  * aws_cloudwatch_event_rule.corpus-events-topic_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_52E707A3
  * aws_cloudwatch_event_rule.forgot-password-topic_PocketEventBridge-Prod-ForgotPasswordEvents-EventBridge-Rule_event-bridge-rule_355DED34
  * aws_cloudwatch_event_rule.list-events-topic_PocketEventBridge-Prod-ListAPIEvents-EventBridge-Rule_event-bridge-rule_59B12A8C
  * aws_cloudwatch_event_rule.list-export-ready-event-topic_PocketEventBridge-Prod-ListExportReadyEvent-EventBridge-Rule_event-bridge-rule_ADE851F1
  * aws_cloudwatch_event_rule.premium-purchase-topic_PocketEventBridge-Prod-PremiumPurchaseEvents-EventBridge-Rule_event-bridge-rule_33C9FFED
  * aws_cloudwatch_event_rule.search-events-topic_PocketEventBridge-Prod-SearchEvents-EventBridge-Rule_event-bridge-rule_9FD9ED5B
  * aws_cloudwatch_event_rule.share-events-topic_PocketEventBridge-Prod-ShareEvents-EventBridge-Rule_event-bridge-rule_17C3EF69
  * aws_cloudwatch_event_rule.shareable-list-events-topic_PocketEventBridge-Prod-ShareableListEvents-EventBridge-Rule_event-bridge-rule_89079947
  * aws_cloudwatch_event_rule.shareable-list-item-events-topic_PocketEventBridge-Prod-ShareableListItemEvents-EventBridge-Rule_event-bridge-rule_A58174C7
  * aws_cloudwatch_event_rule.user-events-topic_PocketEventBridge-Prod-UserEvents-EventBridge-Rule_event-bridge-rule_2F50D82C
  * aws_cloudwatch_event_rule.user-registration-topic_PocketEventBridge-Prod-UserRegistrationEvents-EventBridge-Rule_event-bridge-rule_2C08EBB6
  * aws_cloudwatch_event_target.collection-events-topic_PocketEventBridge-Prod-CollectionEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_3B1D895E
  * aws_cloudwatch_event_target.corpus-events-topic_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_85C722E9
  * aws_cloudwatch_event_target.forgot-password-topic_PocketEventBridge-Prod-ForgotPasswordEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_85393ECF
  * aws_cloudwatch_event_target.list-events-topic_PocketEventBridge-Prod-ListAPIEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_AF6DB474
  * aws_cloudwatch_event_target.list-export-ready-event-topic_PocketEventBridge-Prod-ListExportReadyEvent-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_EB4AA80E
  * aws_cloudwatch_event_target.premium-purchase-topic_PocketEventBridge-Prod-PremiumPurchaseEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_21705BE1
  * aws_cloudwatch_event_target.search-events-topic_PocketEventBridge-Prod-SearchEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_FEF35E04
  * aws_cloudwatch_event_target.share-events-topic_PocketEventBridge-Prod-ShareEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_D18C0832
  * aws_cloudwatch_event_target.shareable-list-events-topic_PocketEventBridge-Prod-ShareableListEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_82319BFD
  * aws_cloudwatch_event_target.shareable-list-item-events-topic_PocketEventBridge-Prod-ShareableListItemEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_984DB41F
  * aws_cloudwatch_event_target.user-events-topic_PocketEventBridge-Prod-UserEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_4927BC64
  * aws_cloudwatch_event_target.user-registration-topic_PocketEventBridge-Prod-UserRegistrationEvents-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_979AAA37
  * aws_cloudwatch_metric_alarm.collection-events-topic_collectionevents-rule-dlq-alarm_4FA339BD
  * aws_cloudwatch_metric_alarm.corpus-events-topic_corpusevents-rule-dlq-alarm_AD6CFB1B
  * aws_cloudwatch_metric_alarm.forgot-password-topic_forgotpasswordevents-rule-dlq-alarm_1C6D4F43
  * aws_cloudwatch_metric_alarm.list-events-topic_listapievents-rule-dlq-alarm_B59BA279
  * aws_cloudwatch_metric_alarm.list-export-ready-event-topic_listexportreadyevent-rule-dlq-alarm_5FC0D2EE
  * aws_cloudwatch_metric_alarm.premium-purchase-topic_premiumpurchaseevents-rule-dlq-alarm_384ADC2F
  * aws_cloudwatch_metric_alarm.search-events-topic_searchevents-rule-dlq-alarm_982C0F00
  * aws_cloudwatch_metric_alarm.share-events-topic_shareevents-rule-dlq-alarm_EB2CC9AF
  * aws_cloudwatch_metric_alarm.shareable-list-events-topic_shareablelistevents-rule-dlq-alarm_CE6C49ED
  * aws_cloudwatch_metric_alarm.shareable-list-item-events-topic_shareablelistitemevents-rule-dlq-alarm_3210A864
  * aws_cloudwatch_metric_alarm.user-events-topic_userevents-rule-dlq-alarm_B2A4F488
  * aws_cloudwatch_metric_alarm.user-registration-topic_userregistrationevents-rule-dlq-alarm_58CB14BC
  * aws_sns_topic.collection-events-topic_FE8E7898
  * aws_sns_topic.corpus-events-topic_9B75EE18
  * aws_sns_topic.forgot-password-topic_events-topic_8A1795BA
  * aws_sns_topic.list-events-topic_93007BF2
  * aws_sns_topic.list-export-ready-event-topic_events-topic_38EBB3C3
  * aws_sns_topic.premium-purchase-topic_events-topic_DAFB4CF9
  * aws_sns_topic.search-events-topic_DD3B019D
  * aws_sns_topic.share-events-topic_041B2C9A
  * aws_sns_topic.shareable-list-events-topic_BE8A97E3
  * aws_sns_topic.shareable-list-item-events-topic_2DDC87EE
  * aws_sns_topic.user-events-topic_D13B4EA6
  * aws_sns_topic.user-registration-topic_events-topic_32C54E40
  * aws_sns_topic_policy.collection-events-topic_events-sns-topic-policy_15A64161
  * aws_sns_topic_policy.corpus-events-topic_events-sns-topic-policy_AAF83DB6
  * aws_sns_topic_policy.forgot-password-topic_events-sns-topic-policy_141E08A6
  * aws_sns_topic_policy.list-events-topic_events-sns-topic-policy_68FEA701
  * aws_sns_topic_policy.list-export-ready-event-topic_events-sns-topic-policy_F93610CB
  * aws_sns_topic_policy.premium-purchase-topic_events-sns-topic-policy_174431A1
  * aws_sns_topic_policy.search-events-topic_events-sns-topic-policy_1723CB22
  * aws_sns_topic_policy.share-events-topic_events-sns-topic-policy_A1DF10C3
  * aws_sns_topic_policy.shareable-list-events-topic_events-sns-topic-policy_FB05016A
  * aws_sns_topic_policy.shareable-list-item-events-topic_events-sns-topic-policy_C46A0ACC
  * aws_sns_topic_policy.user-events-topic_events-sns-topic-policy_E58BBD58
  * aws_sns_topic_policy.user-registration-topic_events-sns-topic-policy_502186CF
  * aws_sqs_queue.collection-events-topic_sns-topic-dql_2AC85488
  * aws_sqs_queue.corpus-events-topic_sns-topic-dql_B84FC5B1
  * aws_sqs_queue.forgot-password-topic_sns-topic-dql_E658DA0C
  * aws_sqs_queue.list-events-topic_sns-topic-dql_1E59528E
  * aws_sqs_queue.list-export-ready-event-topic_sns-topic-dql_BBBA3E67
  * aws_sqs_queue.premium-purchase-topic_sns-topic-dql_4D9B1070
  * aws_sqs_queue.search-events-topic_sns-topic-dql_808FA245
  * aws_sqs_queue.share-events-topic_sns-topic-dql_F1BD00DC
  * aws_sqs_queue.shareable-list-events-topic_sns-topic-dql_902861CA
  * aws_sqs_queue.shareable-list-item-events-topic_sns-topic-dql_CA2C5292
  * aws_sqs_queue.user-events-topic_sns-topic-dql_5E9E9CC8
  * aws_sqs_queue.user-registration-topic_sns-topic-dql_D5B8D05F
* Delete
  * aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D
  * aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59
  * aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419
  * aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60
  * aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33
  * aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B
  * aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3



<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # data.aws_iam_policy_document.collection-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_6D310890 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "collection-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_6D310890" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.corpus-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_2D52B6F5 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "corpus-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_2D52B6F5" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.forgot-password-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_71EAB57C will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forgot-password-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_71EAB57C" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.list-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_24FA7DF3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "list-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_24FA7DF3" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.list-export-ready-event-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_11FA5D19 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "list-export-ready-event-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_11FA5D19" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.premium-purchase-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_76569CF5 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "premium-purchase-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_76569CF5" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.search-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_212AC515 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "search-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_212AC515" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.share-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_5BD56CA8 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "share-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_5BD56CA8" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.shareable-list-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_6A05FE2A will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "shareable-list-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_6A05FE2A" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.shareable-list-item-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_E9542F5D will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "shareable-list-item-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_E9542F5D" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.user-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_8B1DB181 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "user-events-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_8B1DB181" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.user-registration-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_200B430E will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "user-registration-topic_PocketEventBridge-Prod-PocketEventBridge-EventBridge-SNS-Policy_200B430E" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.collection-events-topic_PocketEventBridge-Prod-CollectionEvents-EventBridge-Rule_event-bridge-rule_83F8780B will be created
  + resource "aws_cloudwatch_event_rule" "collection-events-topic_PocketEventBridge-Prod-CollectionEvents-EventBridge-Rule_event-bridge-rule_83F8780B" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "collection-updated",
                  + "collection-created",
                ]
              + source      = "collection-events"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-CollectionEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.corpus-events-topic_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_52E707A3 will be created
  + resource "aws_cloudwatch_event_rule" "corpus-events-topic_PocketEventBridge-Prod-CorpusEvents-EventBridge-Rule_event-bridge-rule_52E707A3" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "add-approved-item",
                  + "remove-approved-item",
                  + "update-approved-item",
                ]
              + source      = "curation-migration-datasync"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-CorpusEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.forgot-password-topic_PocketEventBridge-Prod-ForgotPasswordEvents-EventBridge-Rule_event-bridge-rule_355DED34 will be created
  + resource "aws_cloudwatch_event_rule" "forgot-password-topic_PocketEventBridge-Prod-ForgotPasswordEvents-EventBridge-Rule_event-bridge-rule_355DED34" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Forgot Password Request",
                ]
              + source      = "web-repo"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-ForgotPasswordEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.list-events-topic_PocketEventBridge-Prod-ListAPIEvents-EventBridge-Rule_event-bridge-rule_59B12A8C will be created
  + resource "aws_cloudwatch_event_rule" "list-events-topic_PocketEventBridge-Prod-ListAPIEvents-EventBridge-Rule_event-bridge-rule_59B12A8C" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "ADD_ITEM",
                  + "DELETE_ITEM",
                  + "FAVORITE_ITEM",
                  + "UNFAVORITE_ITEM",
                  + "ARCHIVE_ITEM",
                  + "UNARCHIVE_ITEM",
                  + "ADD_TAGS",
                  + "REPLACE_TAGS",
                  + "CLEAR_TAGS",
                  + "REMOVE_TAGS",
                  + "RENAME_TAG",
                  + "DELETE_TAG",
                  + "list-export-requested",
                ]
              + source      = "list-api"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-ListAPIEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.list-export-ready-event-topic_PocketEventBridge-Prod-ListExportReadyEvent-EventBridge-Rule_event-bridge-rule_ADE851F1 will be created
  + resource "aws_cloudwatch_event_rule" "list-export-ready-event-topic_PocketEventBridge-Prod-ListExportReadyEvent-EventBridge-Rule_event-bridge-rule_ADE851F1" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "list-export-ready",
                ]
              + source      = "account-data-deleter"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-ListExportReadyEvent-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.premium-purchase-topic_PocketEventBridge-Prod-PremiumPurchaseEvents-EventBridge-Rule_event-bridge-rule_33C9FFED will be created
  + resource "aws_cloudwatch_event_rule" "premium-purchase-topic_PocketEventBridge-Prod-PremiumPurchaseEvents-EventBridge-Rule_event-bridge-rule_33C9FFED" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Premium Purchase",
                ]
              + source      = "web-repo"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-PremiumPurchaseEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.search-events-topic_PocketEventBridge-Prod-SearchEvents-EventBridge-Rule_event-bridge-rule_9FD9ED5B will be created
  + resource "aws_cloudwatch_event_rule" "search-events-topic_PocketEventBridge-Prod-SearchEvents-EventBridge-Rule_event-bridge-rule_9FD9ED5B" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "search_response_generated",
                ]
              + source      = "search-api-events"
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-SearchEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_rule.share-events-topic_PocketEventBridge-Prod-ShareEvents-EventBridge-Rule_event-bridge-rule_17C3EF69 will be created
  + resource "aws_cloudwatch_event_rule" "share-events-topic_PocketEventBridge-Prod-ShareEvents-EventBridge-Rule_event-bridge-rule_17C3EF69" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "pocket_share_created",
                  + "pocket_share_context_updated",
                ]
              + source      = "shares-api-events"
            }
        )
   

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

      = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.list-events-topic_sns-topic-dql_1E59528E will be created
  + resource "aws_sqs_queue" "list-events-topic_sns-topic-dql_1E59528E" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-ListAPIEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.list-export-ready-event-topic_sns-topic-dql_BBBA3E67 will be created
  + resource "aws_sqs_queue" "list-export-ready-event-topic_sns-topic-dql_BBBA3E67" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-ListExportReadyEvent-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.premium-purchase-topic_sns-topic-dql_4D9B1070 will be created
  + resource "aws_sqs_queue" "premium-purchase-topic_sns-topic-dql_4D9B1070" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-PremiumPurchaseEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.search-events-topic_sns-topic-dql_808FA245 will be created
  + resource "aws_sqs_queue" "search-events-topic_sns-topic-dql_808FA245" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-SearchEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.share-events-topic_sns-topic-dql_F1BD00DC will be created
  + resource "aws_sqs_queue" "share-events-topic_sns-topic-dql_F1BD00DC" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-ShareEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.shareable-list-events-topic_sns-topic-dql_902861CA will be created
  + resource "aws_sqs_queue" "shareable-list-events-topic_sns-topic-dql_902861CA" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-ShareableListEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.shareable-list-item-events-topic_sns-topic-dql_CA2C5292 will be created
  + resource "aws_sqs_queue" "shareable-list-item-events-topic_sns-topic-dql_CA2C5292" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.user-events-topic_sns-topic-dql_5E9E9CC8 will be created
  + resource "aws_sqs_queue" "user-events-topic_sns-topic-dql_5E9E9CC8" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-UserEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.user-registration-topic_sns-topic-dql_D5B8D05F will be created
  + resource "aws_sqs_queue" "user-registration-topic_sns-topic-dql_D5B8D05F" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-UserRegistrationEvents-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 72 to add, 0 to change, 7 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":946,"Program":"tfcmt","SHA1":"865c3c7a8c0f10c6d87c96d719700ffbdf3bf1d1","Target":"pocket-event-bridge-cdk-production","Vars":{},"WorkflowName":"Pocket Event Bridge"} -->